In [1]:
import pandas as pd;
import numpy as np;

In [2]:
df = pd.read_csv('car_data_100rows.csv')
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Toyota      60397  Diesel  Second Owner         319963
1  Hyundai     111387  Petrol   First Owner         580761
2     Tata      21016  Diesel   Third Owner         348710
3   Toyota      75591  Diesel   First Owner         320984
4    Honda      43247     CNG   First Owner         997059

In [3]:
df['brand'].value_counts()

brand
Hyundai     21
Skoda       17
Toyota      16
Mahindra    15
Tata        12
Honda       11
Maruti       8
Name: count, dtype: int64

In [6]:
df['brand'].nunique()

7

In [7]:
# One_Hot_Encoding using Pandas.................................................
pd.get_dummies(df, columns=['fuel', 'owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_Petrol,owner_First Owner,owner_Second Owner,owner_Third Owner
0,Toyota,60397,319963,False,True,False,False,True,False
1,Hyundai,111387,580761,False,False,True,True,False,False
2,Tata,21016,348710,False,True,False,False,False,True
3,Toyota,75591,320984,False,True,False,True,False,False
4,Honda,43247,997059,True,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...
95,Mahindra,147948,612153,True,False,False,False,True,False
96,Hyundai,75016,167215,False,True,False,False,False,True
97,Mahindra,160546,955474,False,False,True,False,True,False
98,Toyota,41959,244356,False,False,True,True,False,False
99,Toyota,156602,303861,True,False,False,True,False,False

In [8]:
pd.get_dummies(df, columns=['fuel', 'owner'], drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_Petrol,owner_Second Owner,owner_Third Owner
0,Toyota,60397,319963,True,False,True,False
1,Hyundai,111387,580761,False,True,False,False
2,Tata,21016,348710,True,False,False,True
3,Toyota,75591,320984,True,False,False,False
4,Honda,43247,997059,False,False,False,False
...,...,...,...,...,...,...,...
95,Mahindra,147948,612153,False,False,True,False
96,Hyundai,75016,167215,True,False,False,True
97,Mahindra,160546,955474,False,True,True,False
98,Toyota,41959,244356,False,True,False,False
99,Toyota,156602,303861,False,False,False,False

In [14]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(
    df.iloc[ : , 0:4], 
    df.iloc[ : , 0:4], 
    test_size=0.2,
    random_state=1
)
x_train.head()

       brand  km_driven    fuel         owner
2       Tata      21016  Diesel   Third Owner
73      Tata     129225     CNG  Second Owner
97  Mahindra     160546  Petrol  Second Owner
62     Skoda     130687     CNG   Third Owner
19   Hyundai     153767  Diesel   First Owner

In [34]:
from sklearn.preprocessing import OneHotEncoder

ohe = OneHotEncoder(drop='first', sparse_output=False, dtype=np.int32)

x_train_new = ohe.fit_transform(x_train[['fuel', 'owner']])
x_test_new = ohe.transform(x_test[['fuel', 'owner']])

In [36]:
np.hstack((x_train[['brand', 'km_driven']].values, x_train_new))

array([['Tata', 21016, 1, 0, 0, 1],
       ['Tata', 129225, 0, 0, 1, 0],
       ['Mahindra', 160546, 0, 1, 1, 0],
       ['Skoda', 130687, 0, 0, 0, 1],
       ['Hyundai', 153767, 1, 0, 0, 0],
       ['Toyota', 28392, 0, 1, 1, 0],
       ['Skoda', 112787, 1, 0, 0, 1],
       ['Skoda', 149312, 0, 0, 1, 0],
       ['Toyota', 128066, 0, 1, 0, 0],
       ['Hyundai', 72256, 0, 0, 0, 0],
       ['Hyundai', 82623, 1, 0, 0, 1],
       ['Toyota', 156602, 0, 0, 0, 0],
       ['Maruti', 141626, 1, 0, 0, 0],
       ['Mahindra', 147948, 0, 0, 1, 0],
       ['Tata', 64262, 1, 0, 0, 0],
       ['Mahindra', 147478, 0, 0, 0, 0],
       ['Maruti', 159182, 0, 0, 0, 0],
       ['Hyundai', 70015, 0, 0, 0, 1],
       ['Hyundai', 59504, 1, 0, 1, 0],
       ['Honda', 42662, 1, 0, 0, 1],
       ['Hyundai', 166779, 0, 0, 0, 0],
       ['Tata', 110982, 0, 1, 0, 0],
       ['Maruti', 22693, 0, 0, 0, 1],
       ['Honda', 68984, 0, 0, 1, 0],
       ['Mahindra', 38047, 0, 1, 1, 0],
       ['Mahindra', 55222, 1, 0, 0, 0],
       ['Hyundai', 44538, 0, 1, 0, 0],
       ['Skoda', 181152, 0, 0, 0, 1],
       ['Hyundai', 81858, 0, 1, 1, 0],
       ['Toyota', 41959, 0, 1, 0, 0],
       ['Mahindra', 143684, 0, 1, 0, 1],
       ['Toyota', 139176, 0, 0, 0, 0],
       ['Tata', 184231, 0, 1, 0, 1],
       ['Honda', 43247, 0, 0, 0, 0],
       ['Maruti', 43419, 0, 1, 0, 0],
       ['Honda', 178338, 0, 0, 1, 0],
       ['Mahindra', 199262, 1, 0, 0, 1],
       ['Mahindra', 173048, 0, 0, 0, 0],
       ['Toyota', 75591, 1, 0, 0, 0],
       ['Toyota', 84044, 0, 1, 0, 1],
       ['Hyundai', 154633, 1, 0, 0, 0],
       ['Skoda', 184899, 0, 1, 0, 0],
       ['Hyundai', 137845, 1, 0, 1, 0],
       ['Toyota', 97373, 0, 0, 0, 0],
       ['Hyundai', 133252, 0, 1, 1, 0],
       ['Toyota', 145117, 1, 0, 0, 1],
       ['Skoda', 106807, 0, 1, 1, 0],
       ['Mahindra', 142096, 0, 0, 0, 1],
       ['Toyota', 60397, 1, 0, 1, 0],
       ['Skoda', 43776, 0, 0, 1, 0],
       ['Hyundai', 142409, 0, 0, 1, 0],
       ['Skoda', 156330, 0, 0, 0, 1],
       ['Skoda', 127059, 0, 0, 0, 0],
       ['Maruti', 107939, 1, 0, 0, 0],
       ['Toyota', 29268, 0, 0, 1, 0],
       ['Hyundai', 75016, 1, 0, 0, 1],
       ['Tata', 71214, 0, 1, 0, 0],
       ['Hyundai', 95450, 0, 0, 1, 0],
       ['Skoda', 95766, 1, 0, 1, 0],
       ['Hyundai', 134752, 0, 1, 0, 0],
       ['Tata', 58660, 1, 0, 1, 0],
       ['Mahindra', 32666, 1, 0, 1, 0],
       ['Honda', 159643, 0, 1, 0, 0],
       ['Skoda', 140151, 1, 0, 0, 1],
       ['Mahindra', 144375, 1, 0, 0, 0],
       ['Tata', 118806, 1, 0, 0, 0],
       ['Maruti', 33986, 0, 1, 1, 0],
       ['Tata', 102798, 0, 0, 1, 0],
       ['Toyota', 173371, 0, 1, 0, 1],
       ['Mahindra', 129556, 0, 0, 1, 0],
       ['Hyundai', 111387, 0, 1, 0, 0],
       ['Mahindra', 60774, 0, 1, 0, 0],
       ['Skoda', 169213, 1, 0, 0, 0],
       ['Skoda', 45939, 1, 0, 0, 1],
       ['Tata', 44300, 0, 1, 1, 0],
       ['Honda', 193629, 0, 1, 1, 0],
       ['Honda', 32185, 1, 0, 1, 0],
       ['Hyundai', 63585, 0, 0, 1, 0],
       ['Honda', 58044, 1, 0, 0, 0],
       ['Hyundai', 133569, 0, 0, 1, 0]], dtype=object)

In [38]:
# count = df['brand'].value_count()
# df['brand'].nunique()
# threshold = 100
# repl = count[count <= threshold].index
# pd.get_dummies(df['brand'].replace(repl, 'uncommon')).sample(5)